
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        1 |           3 |          0 |
## Affected resources by action

|  Action  | Resources                                                                    |
|:--------:|:-----------------------------------------------------------------------------|
|    🟢    | `module.keycloak.module.pod[0].aws_route53_record.extra_caa_amazon[0]`       |
|    🟡    | `module.keycloak.aws_ecs_cluster.ecs`                                        |
|    🟡    | `module.keycloak.module.pod[0].aws_alb.website`                              |
|    🟡    | `module.keycloak.module.pod[0].module.instance_profile.aws_iam_role.profile` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.keycloak.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/auth"
        name     = "auth"
      ~ tags     = {
            "VantaContainsEPHI"     = "false"
            "VantaContainsUserData" = "false"
            "VantaNonProd"          = "true"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/ecs/aws"
            "environment"           = "development"
          ~ "module_version"        = "5.9.1" -> "5.12.0"
            "service"               = "auth"
        }
      ~ tags_all = {
          ~ "module_version"        = "5.9.1" -> "5.12.0"
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.module.pod[0].aws_alb.website will be updated in-place
  ~ resource "aws_alb" "website" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c"
        name                                                         = "auth2024030222363678900000000a"
      ~ tags                                                         = {
            "AmazonECSManaged"         = "true"
            "Name"                     = "auth"
            "VantaContainsEPHI"        = "false"
            "VantaContainsUserData"    = "false"
            "VantaNonProd"             = "true"
            "access_log_bucket"        = "auth-access-log-20240523222424592900000001"
            "access_log_bucket_policy" = "auth-access-log-20240523222424592900000001"
            "account"                  = "493370826424"
            "created_by_module"        = "infrahouse/website-pod/aws"
            "environment"              = "development"
          ~ "module_version"           = "5.6.0" -> "5.8.2"
            "parent_module"            = "infrahouse/ecs/aws"
            "service"                  = "auth"
            "upstream_module"          = "infrahouse/ecs/aws"
        }
      ~ tags_all                                                     = {
          ~ "module_version"           = "5.6.0" -> "5.8.2"
            # (14 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.keycloak.module.pod[0].aws_route53_record.extra_caa_amazon[0] will be created
  + resource "aws_route53_record" "extra_caa_amazon" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "auth.infrahouse.com"
      + records         = [
          + "0 issue \"amazon.com\"",
          + "0 issuewild \";\"",
        ]
      + ttl             = 300
      + type            = "CAA"
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.keycloak.module.pod[0].module.instance_profile.aws_iam_role.profile will be updated in-place
  ~ resource "aws_iam_role" "profile" {
        id                    = "auth-instance-czqdboofg13020241001134545613900000004"
        name                  = "auth-instance-czqdboofg13020241001134545613900000004"
      ~ tags                  = {
            "AmazonECSManaged"      = "true"
            "Name"                  = "auth"
            "VantaContainsEPHI"     = "false"
            "VantaContainsUserData" = "false"
            "VantaNonProd"          = "true"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/instance-profile/aws"
            "environment"           = "development"
          ~ "module_version"        = "1.8.1" -> "1.9.0"
            "parent_module"         = "infrahouse/ecs/aws"
            "service"               = "auth"
            "upstream_module"       = "infrahouse/website-pod/aws"
        }
      ~ tags_all              = {
          ~ "module_version"        = "1.8.1" -> "1.9.0"
            # (12 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiAzLCAiZGVzdHJveSI6IDB9fQ==
```
</details>